import 'package:flutter/material.dart';

class Terms extends StatelessWidget {
  const Terms({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('الشروط والأحكام'),
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(20),
        child: Text(text),
      ),
    );
  }
}

final text = '''
الشروط والأحكام لاستخدام تطبيق 
Qio

آخر تحديث: 28.01.2025

يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام تطبيق Qio الذي تديره شركة قطاية  

1. الموافقة على الشروط

باستخدامك للتطبيق، فإنك توافق على الالتزام بهذه الشروط والأحكام. إذا كنت لا توافق على أي جزء من هذه الشروط، فلا يجوز لك استخدام التطبيق.

2. استخدام التطبيق

يتم تقديم التطبيق لأغراض  التسوق
ويمكن الجميع يستفيد من تطبيق 


لا يجوز استخدام التطبيق لأي
 أغراض غير قانونية أو غير مصرح بها.

تحتفظ Qio بالحق في تعليق أو إنهاء حسابك إذا تم انتهاك هذه الشروط.


3. جمع البيانات واستخدامها


نستخدم  البيانات لتحسين تجربة المستخدم، تقديم إعلانات مستهدفة، وتحليل الأداء.

قد تتم مشاركة بياناتك مع شركاء تسويقيين لأغراض تسويقية وإعلانية، ولكن بطريقة لا تعرض خصوصيتك للخطر.

نحن نضمن أن جميع البيانات التي تتم مشاركتها يتم التعامل معها وفقًا للقوانين واللوائح المعمول بها.


4. الأمان والخصوصية

نلتزم بحماية بيانات المستخدم واتخاذ التدابير الأمنية المناسبة لمنع الوصول غير المصرح به إلى معلوماتك.

لا نبيع بياناتك لأي جهات خارجية إلا لأغراض تسويقية وفقًا لما هو مذكور في هذا الاتفاق.


5. حقوق الملكية الفكرية

جميع المحتويات والعلامات التجارية والشعارات والبرمجيات المتعلقة بالتطبيق هي ملك لنا أو لمقدمي التراخيص لدينا.

لا يُسمح بإعادة إنتاج، توزيع، أو تعديل أي جزء من التطبيق دون إذن خطي مسبق منا.


6. إخلاء المسؤولية

يتم توفير التطبيق "كما هو" دون أي ضمانات، صريحة أو ضمنية، حول دقته أو أدائه.

نحن غير مسؤولين عن أي خسائر أو أضرار ناتجة عن استخدام التطبيق.


7. التواصل والدعم

لأي استفسارات أو طلبات متعلقة باستخدام التطبيق أو البيانات الشخصية، يمكنكم التواصل معنا عبر البريد الإلكتروني التالي:
birarry44@gmail.com


8. التعديلات على الشروط

نحتفظ بالحق في تعديل هذه الشروط في أي وقت، وسيتم إشعار المستخدمين بأي تغييرات هامة.


باستمرارك في استخدام التطبيق بعد تحديث الشروط، فإنك توافق على الالتزام بالشروط المعدلة.

شكرًا لاستخدامك Qio
''';
